/********************  COPYRIGHT(C) ***************************************
**--------------文件信息--------------------------------------------------------
**文   件   名: apcprotocol.h
**创   建   人: 于宏图
**创 建  日 期: 
**程序开发环境：
**描        述: 中移动APC协议处理程序头文件
**--------------历史版本信息----------------------------------------------------
** 创建人: 于宏图
** 版  本: v1.0
** 日　期: 2012.10.29
** 描　述: 原始版本
**--------------当前版本修订----------------------------------------------------
** 修改人:
** 版  本:
** 日　期:
** 描　述:
**------------------------------------------------------------------------------
**
*******************************************************************************/
#ifndef _APCPROTOCOL_H
#define _APCPROTOCOL_H

#include "../common/druheader.h"

int APCEscSum(char *pbuf, INT16U sum);
int	APCEscProcess(char *pbuf, int sum);
int APCPack(APPack_t *p_packbuf, char *sdbuf);
int	APCUnpack(char *rcbuf, int rcnum, APPack_t *p_packbuf);

#endif  // __APCPROTOCOL_H
/*********************************************************************************
**                            End Of File
*********************************************************************************/
