/********************  COPYRIGHT(C) ***************************************
**--------------文件信息--------------------------------------------------------
**文   件   名: commonfun.h
**创   建   人: 于宏图
**创 建  日 期: 
**程序开发环境：
**描        述: 采用CCITT标准进行的CRC校验头文件
**--------------历史版本信息----------------------------------------------------
** 创建人: 于宏图
** 版  本: v1.0
** 日　期: 
** 描　述: 原始版本
**--------------当前版本修订----------------------------------------------------
** 修改人:
** 版  本:
** 日　期:
** 描　述:
**------------------------------------------------------------------------------
**
*******************************************************************************/
#ifndef _COMMONFUN_H
#define _COMMONFUN_H

#include "druheader.h"

INT16U CCITT_CRC16(char *pbuf, INT16U len);
void ClearComBuf(ComBuf_t *pcombuf);
int ComStrWriteLog(char *pstr, int num);
int ComDataWriteLog(char *buf, int num);
void DisplaySysTime(void);
void ComDataHexDis(char *buf, int sum);
#endif //_COMMONFUN_H
/*******************************************************************************************************
**                            End Of File
********************************************************************************************************/
