/*******************************************************************************
********************************************************************************
* 文件名称:  str_deal.h
* 功能描述:  字符串高级操作头文件
* 使用说明:  
* 文件作者:	H4
* 编写日期: （2013/04/11）
* 修改历史:
* 修改日期    修改人       修改内容
*-------------------------------------------------------------------------------

*******************************************************************************/
#ifndef _STR_DEAL_H
#define _STR_DEAL_H

//删除sarg中所有不可见字符并存入oarg中，备注：asc||码 length不能超过sarg或oarg的范围
extern int strdelnull(char* sarg,const char* darg,unsigned int length);

//比较asc||码 备注：按顺序但不可见字符无效。相同返回0其余为不相同
//例：str1="1 2345" str2="12 3 45"比较后str1=str2
extern int strcmpasc(const char *str1,const char *str2,unsigned int length);

#endif