/*******************************************************************************
********************************************************************************
* 文件名称:  dru_ads58c48.h
* 功能描述:  ads58c48的头文件
* 使用说明: 	所有与ads58c48相关的宏定义都在此定义
* 文件作者:	H4
* 编写日期: （2012/06/18）
* 修改历史:
* 修改日期    修改人       修改内容
*-------------------------------------------------------------------------------

*******************************************************************************/
#ifndef _DRU_ADS58C48_H
#define _DRU_ADS58C48_H
#define SELECT_ADS58C48 5
#define ADS58C48_REG_LENGTH 16
int dru_ads58c48_init(void);
void dru_ads58c48_clkout_delay_0p5_ns();

void dru_ads58c48_clkout_delay_1_ns();

void dru_ads58c48_test_on();

void dru_ads58c48_test_off();

#endif
