/*******************************************************************************
********************************************************************************
* 文件名称:  dru_ss112.c
* 功能描述:  
*						
* 使用说明: 
* 文件作者:	H4
* 编写日期: （2014/07/29）
* 修改历史:
* 修改日期    修改人       修改内容
*-------------------------------------------------------------------------------

*******************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <fcntl.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <sys/mman.h>
#include <string.h>
#include <time.h>
#include "dru_spi.h"
#include "dru_ss112.h"
#include "../../driver/omap_gpio.h"
/*******************************************************************************
* 函数名称: ss112_spi_delay
* 功    能: 用于spi工作延时
* 参    数:
* 参数名称         类型                描述
* delayTime      unsigned char      延时时长
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2012/06/15  V1.0     H4     无       ：
*******************************************************************************/
void ss112_spi_delay(unsigned char delayTime)                                                   
{                                                                                        
    unsigned int index = 0;                                                                    
    for (index = 0; index < delayTime * 10; index++)   
    {                                                                                    
        asm(" nop");                                                                     
    }                                                                                    
    return;                                                                              
}          
/*******************************************************************************
* 函数名称: ss112_init
* 功    能: 
* 参    数:
* 参数名称         类型                描述
* 
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_init(void)
{
	GPIO_OUTPUT_DIR(67,0);
	GPIO_OUTPUT_DIR(67,1);
	GPIO_OUTPUT_DIR(67,3);
	GPIO_OUTPUT_DIR(67,11);
	GPIO_OUTPUT_DIR(67,10);
	GPIO_OUTPUT_DIR(67,9);
}

/*******************************************************************************
* 函数名称: ss112_spi_clk
* 功    能: 
* 参    数:
* 参数名称         类型                描述
* level      unsigned char         为fpga spi的clk脚输出电平
* clkChoice  unsigned char				clk寄存器选择
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_spi_clk(unsigned char level)                                              
{                                                                             
     if(level==1){
		GPIO_SET(67, 1);
	}else{
		GPIO_CLR(67, 1);
	}                      
}                                                                             
/*******************************************************************************
* 函数名称: ss112_spi_le_lte1
* 功    能: 
* 参    数:
* 参数名称         类型                描述
*
* 
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_spi_le_lte1(unsigned char level)                                              
{                                                                             
  	 if(level==1){
		GPIO_SET(67, 9);
	}else{
		GPIO_CLR(67, 9);
	}           
  	                                                       
}           
/*******************************************************************************
* 函数名称: ss112_spi_le_lte2
* 功    能: 
* 参    数:
* 参数名称         类型                描述
*
* 
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_spi_le_lte2(unsigned char level)                                              
{                                                                             
  	 if(level==1){
		GPIO_SET(67, 11);
	}else{
		GPIO_CLR(67, 11);
	}           
  	                                                       
}          
/*******************************************************************************
* 函数名称: ss112_spi_le_td
* 功    能: 
* 参    数:
* 参数名称         类型                描述
*
* 
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_spi_le_td(unsigned char level)                                              
{                                                                             
  	 if(level==1){
		GPIO_SET(67, 3);
	}else{
		GPIO_CLR(67, 3);
	}           
  	                                                       
}          
/*******************************************************************************
* 函数名称: ss112_spi_le_gsm
* 功    能: 
* 参    数:
* 参数名称         类型                描述
*
* 
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_spi_le_gsm(unsigned char level)                                              
{                                                                             
  	 if(level==1){
		GPIO_SET(67, 10);
	}else{
		GPIO_CLR(67,10);
	}           
  	                                                       
}          
/*******************************************************************************
* 函数名称: ss112_spi_out
* 功    能: 
* 参    数:
* 参数名称         类型                描述
* 
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_spi_out(unsigned char level)                                              
{                                                                             
 	 if(level==1){
		GPIO_SET(67,0);
	}else{
		GPIO_CLR(67,0);
	}           
}           

/*******************************************************************************
* 函数名称: ss112_lte1_config
* 功    能: 
* 参    数:
* 参数名称         类型                描述
* 
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_lte1_config(unsigned char att)
{
	unsigned char i,j;
	if(att>63){
		j=63;
	}else{
		j=att;
	}
	ss112_spi_le_lte1(0);
	ss112_spi_delay(1);
	for(i=6;i>0;i--){
		ss112_spi_delay(1);
		ss112_spi_clk(0);
		ss112_spi_delay(1);
		if(j&(1<<(i-1))){
			ss112_spi_out(1);
		}else{
			ss112_spi_out(0);
		}
		ss112_spi_delay(1);
		ss112_spi_clk(1);
		ss112_spi_delay(1);
	}
	ss112_spi_le_lte1(1);
	ss112_spi_delay(1);
	ss112_spi_le_lte1(0);
}

/*******************************************************************************
* 函数名称: ss112_lte2_config
* 功    能: 
* 参    数:
* 参数名称         类型                描述
* 
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_lte2_config(unsigned char att)
{
	unsigned char i,j;
	if(att>63){
		j=63;
	}else{
		j=att;
	}
	ss112_spi_le_lte2(0);
	ss112_spi_delay(1);
	for(i=6;i>0;i--){
		ss112_spi_delay(1);
		ss112_spi_clk(0);
		ss112_spi_delay(1);
		if(j&(1<<(i-1))){
			ss112_spi_out(1);
		}else{
			ss112_spi_out(0);
		}
		ss112_spi_delay(1);
		ss112_spi_clk(1);
		ss112_spi_delay(1);
	}
	ss112_spi_le_lte2(1);
	ss112_spi_delay(1);
	ss112_spi_le_lte2(0);
}
/*******************************************************************************
* 函数名称: ss112_td_config
* 功    能: 
* 参    数:
* 参数名称         类型                描述
* 
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_td_config(unsigned char att)
{
	unsigned char i,j;
	if(att>63){
		j=63;
	}else{
		j=att;
	}
	ss112_spi_le_td(0);
	ss112_spi_delay(1);
	for(i=6;i>0;i--){
		ss112_spi_delay(1);
		ss112_spi_clk(0);
		ss112_spi_delay(1);
		if(j&(1<<(i-1))){
			ss112_spi_out(1);
		}else{
			ss112_spi_out(0);
		}
		ss112_spi_delay(1);
		ss112_spi_clk(1);
		ss112_spi_delay(1);
	}
	ss112_spi_le_td(1);
	ss112_spi_delay(1);
	ss112_spi_le_td(0);
}
/*******************************************************************************
* 函数名称: ss112_gsm_config
* 功    能: 
* 参    数:
* 参数名称         类型                描述
* 
* 返回值:
* 无
* 说   明:
* 日   期     版本    作者   修改人      DEBUG
* -----------------------------------------------------------------
* 2014/07/29  V1.0     H4     无       ：
*******************************************************************************/
void ss112_gsm_config(unsigned char att)
{
	unsigned char i,j;
	if(att>63){
		j=63;
	}else{
		j=att;
	}
	ss112_spi_le_gsm(0);
	ss112_spi_delay(1);
	for(i=6;i>0;i--){
		ss112_spi_delay(1);
		ss112_spi_clk(0);
		ss112_spi_delay(1);
		if(j&(1<<(i-1))){
			ss112_spi_out(1);
		}else{
			ss112_spi_out(0);
		}
		ss112_spi_delay(1);
		ss112_spi_clk(1);
		ss112_spi_delay(1);
	}
	ss112_spi_le_gsm(1);
	ss112_spi_delay(1);
	ss112_spi_le_gsm(0);
}